{
  "fullstack": "I recently worked with a team of 3 other engineers to construct the front end for an e-commerce website. We coordinated styling using CSS with styled components to build out separate micro-services using React to make our headless API come to life. I then proceeded to scale the back end of my teammate’s microservice so it could handle a throughput of 70,000 rpm with < 1% error rate. I refashioned the API using Postgres, optimized the queries with horizontal partitioning, deployed on AWS t.2 micro instances, and load-balanced with Nginx so I could verify that the front end could easily handle tens of millions of records. Working on your team, I will be able to quickly adapt to foreign code bases and provide my own clean code to improve both workflow and efficiency of any software I am exposed to.",
  "frontend": "My experience with modern, full stack Javascript including Node.js, React, Express, Test Driven Development, non-relational and relational databases makes me the kind of developer that can bring value to any team. Working remotely with a team of three developers I recently built the front end for an ecommerce store using React.js and reactstrap with microservices and a headless API to deploy to AWS. This resulted in a beautiful and responsive UI and seamless user experience. My performance improvements led to a 90+ Google Lighthouse score. This project is just one of many that I have worked on that has led to success beyond what was required and all the while enjoying the challenges of working in team based settings.",
  "backend": "My experience with modern, full stack Javascript, non-relational as well as relational databases makes me the kind of developer that can bring value to any team. Working remotely with a team of three developers I recently refactored a database and an API on Amazon Web Services into a PostgreSQL and Express back end that performantly queried a database and was able to handle up to 68,000 requests per minute on horizontally scaled EC2 micro instances. Our clear communication, teamwork and technical expertise led us to perform above and beyond the project specifications. This project is just one of many that I have worked on that has led to success beyond what was required and all the while enjoying the challenges of working in team based settings."
}
