{
  "frontend": "My experience with modern, full stack Javascript including Node.js, React, Express, non-relational and relational databases makes me the kind of developer that can bring value to any team. Working remotely with a team of three developers I recently built the front end for an ecommerce store using React.js and reactstrap with microservices and a headless API to deploy to AWS. My performance improvements led to a 90+ Google Lighthouse score. This project is just one of many that I have worked on that has led to success beyond what was required and all the while enjoying the challenges of working in team based settings.",
  "fullstack": "My experience with modern, full stack Javascript including Node.js, React, Express, non-relational and relational databases makes me the kind of developer that can bring value to any team. I recently built a Tinder clone for puppies to meet puppies using React, Node.js, PostgreSQL, and AWS. This project’s success led to a 37 fold increase in puppies meeting puppies in pandemic times. This project is just one of many that I have worked on that has led to success beyond what was required and all the while enjoying the challenges and rewards of working in team based settings.",
  "backend": "My experience with modern, full stack Javascript, non-relational as well as relational databases makes me the kind of developer that can bring value to any team. Working remotely with a team of three developers I recently refactored a database and an API on Amazon Web Services into a PostgreSQL and Express back end that performantly queried a database and was able to handle up to 68,000 requests per minute on horizontally scaled EC2 micro instances. Our clear communication, teamwork and technical expertise led us to perform above and beyond the project specifications. This project is just one of many that I have worked on that has led to success beyond what was required and all the while enjoying the challenges of working in team based settings."
}
